// 1. Написать функцию которая принимает число через input и если оно меньше или равно 34 печатает ваше имя иначе имя вашей мамы.
function task1() {
    t = prompt('Введите число ')
    if (t <= 34) {
        console.log('Илья')
    }else{
        console.log('Елена')
    }
}

task1()
// 2. Написать функцию которая принимает 2 числа  через input , и если их сумма равна 5 то делит эту сумму на 2 и
// возвращает результат деления в противном случае возвращает их сумму.
function task2() {
    a = number(prompt('Введите первое число'))
    b = number(prompt('Введите второе число'))
    if (a + b) {
        
    }
}
// 3. Написать функцию принимающую строку  через input и если она меньше пяти символов напечатать её
// иначе напечатать сообщение 'строка сильно большая , я устал'.
//
// 4. Написать функцию которая спрашивает у пользователя 2 числа  через input  и если первое больше второго печатает их сумму иначе печатает их произведение.
//
// 5. Написать функцию которая спрашивает таблицу умножения  через input  у пользователя и если он отвечает верно
// печатает 'верно' иначе печатает неверно.
//
// 6. Написать функцию которая спрашивает у пользователя столицу РБ  через input  и предлагает варианты:
// a: Бобруйск
// b: Лондон
// с: Минск
// Если пользователь ответил правильно - напечатать “Верно” иначе Неверно”
//
// 7. Написать функцию которая принимает строку как аргумент, затем спрашивает какое слово заменить и каким словом заменить  через input .
//
// Пример вызова функции:
// fn('Какой прекрасный день')
// Какое слово заменить: прекрасный  # спрашивает через input
// Каким словом заменить: ужасный    # спрашивает через input
// 'Какой ужасный день'                        # fn возвращает такую строчку
//
// 8. Написать функцию принимающую имя. Если имена 'Вася' или 'Петя' то печатает привет братаны.
// Если она 'Толик' то напечатать 'Поделись на нолик'. Если имя не является 'Вася' или 'Петя' или 'Толик'  то функция печатает - ‘Я тебя не знаю’.
//
// 9.* Написать функцию, которая принимает день месяц и год в виде чисел и печатает Yes если такая дата существует и No если такой даты не существует. Считать, что в феврале всегда 28 дней.
